row = (''''Функція split() використовується для розділення рядка на частини на основі певного '
       'роздільника та повертає список отриманих частин. Основні варіанти використання split():'
       'Функція split() використовується для розділення рядка на частини на основі певного '
       'роздільника та повертає список отриманих частин. Основні варіанти використання split():'
       'Функція split() використовується для розділення рядка на частини на основі певного '
       'роздільника та повертає список отриманих частин. Основні варіанти використання split():'
       'Функція split() використовується для розділення рядка на частини на основі певного '
       'роздільника та повертає список отриманих частин. Основні варіанти використання split():'
       'Функція split() використовується для розділення рядка на частини на основі певного '
       'роздільника та повертає список отриманих частин. Основні варіанти використання split():'
       'Функція split() використовується для розділення рядка на частини на основі певного '
       'роздільника та повертає список отриманих частин. Основні варіанти використання '
       'split():Функція split() використовується для розділення рядка на частини на основі певного '
       'роздільника та повертає список отриманих частин. Основні варіанти використання split():''')

#
# row_split = row.split('split')
# # print(row_split)
# # print(*row_split, sep='\n')
#
# row_split_new_row = row.split('\n')
# # for k in row_split_new_row:
# #     print('-'*8)
# #     print(k)
#
# row_split_space = row.split()  # розбиття по пробілу

# print(row_split_space)
# print(row_split_space[1])

# row_1_line = 'ФункціяФункція     split() використовується'
#
# print(row_1_line.split())
# print(row_1_line.split(' '))
# print(row_1_line.split('використовується'))
# print(row_1_line.split('Функція'))


# user_ids = '1,2,3,4'
# f"?user_ids={user_ids}"
#
# expected_user_ids = user_ids.split(',')
# for user_id in expected_user_ids:
#     print(user_id)


# import re  # regexp
#
# рядок = "apple1,orange2,banana3"
#
# частини = re.split(r'\d', рядок)  # розбиття по числам
# print(частини)